Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_collaborator.this["js-libp2p-dht-adventure:web3-bot"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "js-libp2p-dht-adventure"
      + username                    = "web3-bot"
    }

  # github_repository_file.this["js-libp2p-dht-adventure/.github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/pull_request_template.md [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## Title
            <!---
            The title of the PR will be the commit message of the merge commit, so please make sure it is descriptive enough.
            We utilize the Conventional Commits specification for our commit messages. See <https://www.conventionalcommits.org/en/v1.0.0/#specification> for more information.
            The commit tag types can be of one of the following: feat, fix, deps, refactor, chore, docs. See <https://github.com/libp2p/js-libp2p/blob/master/.github/workflows/main.yml#L235-L242>
            The title must also be fewer than 72 characters long or it will fail the Semantic PR check. See <https://github.com/libp2p/js-libp2p/blob/master/.github/workflows/semantic-pull-request.yml>
            --->
            
            ## Description
            
            <!--
            Please write a summary of your changes and why you made them.
            Please include any relevant issues in here, for example:
            Related https://github.com/libp2p/js-libp2p/issues/ABCD.
            Fixes https://github.com/libp2p/js-libp2p/issues/XYZ.
            -->
            
            ## Notes & open questions
            
            <!--
            Any notes, remarks or open questions you have to make about the PR which don't need to go into the final commit message.
            -->
            
            ## Change checklist
            
            - [ ] I have performed a self-review of my own code
            - [ ] I have made corresponding changes to the documentation if necessary (this includes comments as well)
            - [ ] I have added tests that prove my fix is effective or that my feature works
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "js-libp2p-dht-adventure"
      + sha                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Commentplan -->